clear;
clc;
%%在不考虑刀具偏心的情况下有振动的切削力系数辨识%%
%%刀具几何参数%%
D=10;%%刀具半径
N=4;%%刀具齿数
B=pi/6;%%刀具螺旋角
Cp=2*pi/N;%%齿间角

%%材料牌号%%
%AL7075%

%%刀具刚度参数%%
kx=13543571.05;%%x方向刚度
ky=14808892.07;%%y方向刚度
cx=0.033112;%%x方向阻尼
cy=0.032257;%%y方向阻尼
mx=6.788226;%%x方向质量
my=7.104583;%%y方向质量

%%加工参数%%
%%铣削方式:顺铣%%
Cm=1;%%铣削方式，顺铣为1，逆铣为0
S=2000;%%主轴转速
f=600;%%进给速度
fs=10000;%%采样频率
ap=1;%%轴向切深（单位mm）
ae=3;%%径向切深（单位mm）

%%基本参数计算%%
R=D/2;%%刀具半径
kb=(2*tan(B))/D;%%kβ计算
fe=f/(N*S);%%feed every tooth
w=2*pi*S/60;%%刀具角速度
T=2*pi/w;%%刀具周期
Ts=1/fs;%%采样周期
Ns=floor(60*fs/S);%%一个周期内的采样点个数
if Cm==1%%顺铣
    Cst=pi-acos((R-ae)/R);%%切入角
    Cex=pi;%%切出角
else%%逆铣
    Cst=0;%%切入角
    Cex=acos((R-ae)/R);%%切出角
end
DC=Ts*w;%%两个采样点的角度间隔